# Categorical Data

## Converting Categorical Data into numeric data

### Importing Library

In [1]:
import pandas as pd
import numpy as np

### Loading Data

In [2]:
data = pd.read_csv('C:\\Users\\Vivek hotti\\Desktop\\Practice\\ML DA\\HRDataset.csv')

In [3]:
data.head()

   Emp_ID  Salary  Gender Remarks
0   10026   62506   Male     Nice
1   10084  104437   Male    Good
2   10196   64955  Female   Good
3   10088   64991  Female    Nice
4   10069   50825  Female    Nice

### Checking the Labels in the column

In [4]:
data['Gender'].unique()
# data['Column_name'].unique()
# Helps in extracting the no. of various categories of data present in that column. .i.e. in Gender section there will be either Male category or Female category.
# in this case it is showing us Male and Female are the two categories mentioned in the Gender Column.

array(['Male ', 'Female'], dtype=object)

In [5]:
data['Remarks'].unique()
# in this case it is showing us Nice and Good are the two categories mentioned in the Remarks Column.

array(['Nice', 'Good ', 'Excellent'], dtype=object)

### Checking Count of each label

In [6]:
data['Gender'].value_counts()
# data['Column_Name'].value_counts()
# helps in counting the number of times (sumup) different categories are present. 
# In this case, in the above data set, in the column Gender, there are two data categories : Male & Female. Females are present 176 times in the dataset, while Males are present 135 times in the dataset.

Female    176
Male      135
Name: Gender, dtype: int64

In [7]:
data['Remarks'].value_counts()

Nice         148
Good         110
Excellent     53
Name: Remarks, dtype: int64

# Approach 1 - Label Encoding

Label Encoder encodes labels with value between 0 and the (number_of_class) -1

In [8]:
from sklearn.preprocessing import LabelEncoder
label_encoder_X = LabelEncoder()
# importing Label Encoding Library

In [9]:
label_encoded_data = label_encoder_X.fit_transform(data['Remarks'])
# encoded = encoderFunction.fit_transform(data['ColumnName'])
# converts different categories of string data into respective numeric values.

In [10]:
label_encoded_data
# printing the dataset

array([2, 1, 1, 2, 2, 2, 1, 2, 1, 0, 1, 1, 1, 2, 0, 1, 2, 2, 1, 2, 2, 0,
       1, 1, 2, 2, 2, 0, 2, 1, 0, 1, 1, 1, 2, 2, 1, 2, 2, 0, 2, 2, 2, 1,
       1, 2, 2, 2, 1, 2, 1, 0, 1, 1, 1, 2, 2, 1, 2, 2, 1, 0, 2, 2, 1, 1,
       2, 2, 2, 1, 0, 1, 2, 1, 1, 1, 2, 2, 0, 2, 2, 1, 2, 2, 2, 0, 1, 2,
       2, 2, 1, 2, 0, 2, 1, 1, 1, 2, 2, 1, 2, 0, 1, 2, 2, 2, 1, 1, 0, 2,
       2, 1, 2, 1, 2, 1, 0, 1, 0, 2, 1, 2, 2, 0, 2, 2, 2, 1, 0, 2, 2, 2,
       1, 0, 1, 2, 1, 1, 1, 0, 2, 1, 2, 2, 0, 2, 2, 2, 1, 1, 2, 0, 2, 1,
       2, 1, 2, 1, 1, 1, 0, 2, 1, 2, 2, 1, 2, 2, 2, 1, 0, 2, 2, 2, 1, 2,
       1, 2, 1, 1, 1, 0, 2, 1, 2, 2, 1, 2, 2, 2, 0, 1, 2, 2, 2, 1, 2, 1,
       0, 1, 1, 1, 2, 2, 1, 2, 2, 1, 2, 2, 0, 1, 1, 2, 2, 2, 1, 2, 0, 2,
       1, 1, 1, 2, 2, 1, 2, 2, 1, 0, 2, 2, 1, 1, 2, 2, 0, 0, 0, 0, 2, 1,
       1, 1, 2, 2, 1, 2, 2, 1, 2, 2, 2, 1, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 2, 2, 1, 2, 2, 1, 2, 2, 2, 1, 1, 2, 2, 2, 1, 2, 1, 0, 0, 0, 0,
       0, 0, 1, 2, 2, 1, 2, 2, 2, 1, 1, 2, 2, 2, 1, 2, 1, 2, 1, 0, 0, 0,
       0, 1, 2])

In [11]:
label_encoded_data = pd.DataFrame(data = label_encoded_data, columns = ['Remarks'])
# creating a dataframe of the above dataset.

In [12]:
label_encoded_data
# printing the dataframe

     Remarks
0          2
1          1
2          1
3          2
4          2
..       ...
306        0
307        0
308        0
309        1
310        2

[311 rows x 1 columns]

In [13]:
label_encoded_data['Remarks'].unique()
# printing the numbers that were replaced instead of words

array([2, 1, 0])

Nice is assigned the value - 2 <br/>
Good is assigned the value - 1 <br/>
Excellent is assigned the value - 0 <br/>

# Approach 2 - One Hot Encoding

Binary Labelling with 1 at position where the label is present else 0

In [14]:
one_hot_encoded_data = pd.get_dummies(data, columns=['Remarks', 'Gender'])
# encoded_data = pd.get_dummies(dataframeName, columns=['ColumnName1', 'ColumnName2',...])
# the main purpose of One Hot Encoding (Binary Transformation) is that it creates unique columns based on the various labels we have in the columns.

In [15]:
one_hot_encoded_data
# printing the binary encoded data

,Emp_ID,Salary,Remarks_Excellent,Remarks_Good,Remarks_Nice,Gender_Female,Gender_Male
0,10026,62506,0,0,1,0,1
1,10084,104437,0,1,0,0,1
2,10196,64955,0,1,0,1,0
3,10088,64991,0,0,1,1,0
4,10069,50825,0,0,1,1,0
...,...,...,...,...,...,...,...
306,10135,65893,1,0,0,0,1
307,10301,48513,1,0,0,1,0
308,10010,220450,1,0,0,1,0
309,10043,89292,0,1,0,1,0
310,10271,45046,0,0,1,1,0